In [1]:
# Run this cell to import the Pandas library
import pandas as pd

## Exercise 1

The table below contains names, surnames, and nationality of famous economists

| Name   | Surname   | Nationality |
|--------|-----------| ----------- |
| Adam   | Smith     | Scottish    |
| Thomas | Malthus   | English     |
| David  | Ricardo   | English     |
| Karl   | Marx      | German      |

Using Pandas, create a data frame called ```df_econ``` from the table above. Then do the following:

1. Using indexing, get a series of all names.
2. Using nested indexing, i.e. ```df[][]```, get the surname of Thomas Malthus.
3. Using the ```loc()``` method, get the name and surname of David Ricardo.
4. Using the ```loc()``` method, get a series of all surnames.

In [2]:
# First we want to create a dictionary:
# - The keys will represent the name of the variables
# - The values will represents a list of observations
economists = {
    "Name": ["Adam", "Thomas", "David", "Karl"],
    "Surname": ["Smith", "Malthus", "Ricardo", "Marx"],
    "Nationality": ["Scottish", "English", "English", "German"]
}
economists

{'Name': ['Adam', 'Thomas', 'David', 'Karl'],
 'Surname': ['Smith', 'Malthus', 'Ricardo', 'Marx'],
 'Nationality': ['Scottish', 'English', 'English', 'German']}

In [3]:
# Then we can use the dictionary above to create a data frame using Pandas
df_econ = pd.DataFrame(economists)

# Display the data frame
df_econ

     Name  Surname Nationality
0    Adam    Smith    Scottish
1  Thomas  Malthus     English
2   David  Ricardo     English
3    Karl     Marx      German

In [4]:
# 1
df_econ["Name"]

0      Adam
1    Thomas
2     David
3      Karl
Name: Name, dtype: object

In [5]:
# 2
df_econ["Surname"][1]

'Malthus'

In [6]:
# 3
# We have two options: indexing with a list or slicing
# df_econ.loc[2, ["Name", "Surname"]]
df_econ.loc[2, "Name":"Surname"]

Name         David
Surname    Ricardo
Name: 2, dtype: object

In [7]:
# 4
# We can use the colon : symbol to get all rows in the data frame
# This is the same as slicing from start to end
df_econ.loc[:, "Surname"]

0      Smith
1    Malthus
2    Ricardo
3       Marx
Name: Surname, dtype: object

## Exercise 2

Using the famous economists data frame created above, do the following:

1. Using Boolean indexing, get all English economists.
2. Using Boolean indexing, get all British economists.
3. Using Boolean indexing, get all non-British economists.

In [8]:
df_econ

     Name  Surname Nationality
0    Adam    Smith    Scottish
1  Thomas  Malthus     English
2   David  Ricardo     English
3    Karl     Marx      German

In [9]:
# 1
english_economists = (df_econ["Nationality"] == "English")
df_econ[english_economists]

     Name  Surname Nationality
1  Thomas  Malthus     English
2   David  Ricardo     English

In [10]:
# 2
british_economists = (df_econ["Nationality"] == "English") | (df_econ["Nationality"] == "Scottish")
df_econ[british_economists]

     Name  Surname Nationality
0    Adam    Smith    Scottish
1  Thomas  Malthus     English
2   David  Ricardo     English

In [11]:
# 3
non_british_economists = ~british_economists
df_econ[non_british_economists]

   Name Surname Nationality
3  Karl    Marx      German

## Exercise 3

In Pandas, individual columns of a data frame are objects of their own called ```Series```. For instance, the ```Surname``` column of the economists data frame above is a ```Series```.

In [12]:
# Get Surname series from the famous economists data frame
df_econ["Surname"]

0      Smith
1    Malthus
2    Ricardo
3       Marx
Name: Surname, dtype: object

In [13]:
# Check data type
type(df_econ["Surname"])

pandas.core.series.Series

```Series``` objects have a built-in string method ```str``` that allow us to use all standard string method such as ```capitalize()```, ```count()```, ```upper()```, ```lower()```, and so on.

Pandas will apply the called method to **all** strings in the series. The syntax for calling a string method on a Series object is

```python
series_name.str.method_name()
```

Using string methods, do the following:

1. Convert all names to lowercase
2. Convert all surnames to uppercase
3. Re-covert back to original capitalised version of names and surnames
4. Get all economists with the substring ```"th"``` in their surname

In [14]:
df_econ

     Name  Surname Nationality
0    Adam    Smith    Scottish
1  Thomas  Malthus     English
2   David  Ricardo     English
3    Karl     Marx      German

In [15]:
# 1
df_econ["Name"] = df_econ["Name"].str.lower()
df_econ

     Name  Surname Nationality
0    adam    Smith    Scottish
1  thomas  Malthus     English
2   david  Ricardo     English
3    karl     Marx      German

In [16]:
# 2
df_econ["Surname"] = df_econ["Surname"].str.upper()
df_econ

     Name  Surname Nationality
0    adam    SMITH    Scottish
1  thomas  MALTHUS     English
2   david  RICARDO     English
3    karl     MARX      German

In [17]:
df_econ[["Name", "Surname"]]

     Name  Surname
0    adam    SMITH
1  thomas  MALTHUS
2   david  RICARDO
3    karl     MARX

In [18]:
# 3
# We will use the data frame method applymap() to convert back both names and surnames to their capitalised version.
# applymap() allows us to apply any function to EVERY element in a data frame and return a new data frame with the modified entries.
# Therefore, the strategy is a follows: 1. Define a function that capitalises strings, pass this function to applymap()

# Define a function that capitalises strings
def capitalize_names(name):
    return name.capitalize()

# Use applymap
df_econ[["Name", "Surname"]] = df_econ[["Name", "Surname"]].applymap(capitalize_names)
df_econ

     Name  Surname Nationality
0    Adam    Smith    Scottish
1  Thomas  Malthus     English
2   David  Ricardo     English
3    Karl     Marx      German

In [19]:
# 4
surname_has_th = df_econ["Surname"].str.contains("th")
df_econ.loc[surname_has_th,:]

     Name  Surname Nationality
0    Adam    Smith    Scottish
1  Thomas  Malthus     English

## Exercise 4

The dictionary below represents the unemployment rate for different regions in the U.S. measured every other year from 1995 to 2017 (both included):

```python
data = {
    "NorthEast": [5.9,  5.6,  4.4,  3.8,  5.8,  4.9,  4.3,  7.1,  8.3,  7.9,  5.7],
    "MidWest": [4.5,  4.3,  3.6,  4. ,  5.7,  5.7,  4.9,  8.1,  8.7,  7.4,  5.1],
    "South": [5.3,  5.2,  4.2,  4. ,  5.7,  5.2,  4.3,  7.6,  9.1,  7.4,  5.5],
    "West": [6.6, 6., 5.2, 4.6, 6.5, 5.5, 4.5, 8.6, 10.7, 8.5, 6.1],
    "National": [5.6, 5.3, 4.3, 4.2, 5.8, 5.3, 4.6, 7.8, 9.1, 8., 5.7]
}
```

Create a data frame from the above dictionary using the years as an index. You can assign an index to a data frame with the following syntax

```python
df_name = pd.DataFrame(data, index=years)
```

where ```years``` should be a **list** containing the year values.

Once the data frame is created, do the following:

1. Get the national unemployment rate from 2005 to 2015.
2. Using the method ```mean()``` compute and show the mean unemployment rate for all regions
3. Show in which years the unemployment rate in the MidWest has been above the national average

In [20]:
# Create dictionary
data = {
    "NorthEast": [5.9,  5.6,  4.4,  3.8,  5.8,  4.9,  4.3,  7.1,  8.3,  7.9,  5.7],
    "MidWest": [4.5,  4.3,  3.6,  4. ,  5.7,  5.7,  4.9,  8.1,  8.7,  7.4,  5.1],
    "South": [5.3,  5.2,  4.2,  4. ,  5.7,  5.2,  4.3,  7.6,  9.1,  7.4,  5.5],
    "West": [6.6, 6., 5.2, 4.6, 6.5, 5.5, 4.5, 8.6, 10.7, 8.5, 6.1],
    "National": [5.6, 5.3, 4.3, 4.2, 5.8, 5.3, 4.6, 7.8, 9.1, 8., 5.7]
}

# Create a list that represents the years
years = list(range(1995, 2017, 2))

# Create a data frame with index given by the years
df_unemp = pd.DataFrame(data, index=years)
df_unemp

      NorthEast  MidWest  South  West  National
1995        5.9      4.5    5.3   6.6       5.6
1997        5.6      4.3    5.2   6.0       5.3
1999        4.4      3.6    4.2   5.2       4.3
2001        3.8      4.0    4.0   4.6       4.2
2003        5.8      5.7    5.7   6.5       5.8
2005        4.9      5.7    5.2   5.5       5.3
2007        4.3      4.9    4.3   4.5       4.6
2009        7.1      8.1    7.6   8.6       7.8
2011        8.3      8.7    9.1  10.7       9.1
2013        7.9      7.4    7.4   8.5       8.0
2015        5.7      5.1    5.5   6.1       5.7

In [21]:
# 1
df_unemp.loc[2005:2015, "National"]

2005    5.3
2007    4.6
2009    7.8
2011    9.1
2013    8.0
2015    5.7
Name: National, dtype: float64

In [22]:
# 2
df_unemp.mean()

NorthEast    5.790909
MidWest      5.636364
South        5.772727
West         6.618182
National     5.972727
dtype: float64

In [23]:
# 3
above_mean_midwest = df_unemp["MidWest"] > df_unemp["National"].mean()
df_unemp.loc[above_mean_midwest, "MidWest"]

2009    8.1
2011    8.7
2013    7.4
Name: MidWest, dtype: float64

## Exercise 5

Import the expenditure survey dataset from the comma-separated values (csv) file ```expenditure_data.csv```. Make sure the file is stored in the same folder as this Jupyter notebook or take note of the exact location.

The associated Pandas data frame should be named ```df_exp```.

Get information on the data frame using the ```info()``` method, and show summary statistics for numerical values using the ```describe()``` method.

In [24]:
# Create a dataframe from csv file
df_exp = pd.read_csv("expenditure_data.csv")
df_exp

,expenditure,income,maininc,region,nadults,nkids,SexHRP,housing,internet
0,380.6958,465.360,earnings,East Mid,2 adults,Two or m,Female,Public r,1
1,546.4134,855.260,earnings,London,2 adults,No child,Female,Owned,1
2,242.1890,160.960,earnings,South Ea,1 adult,No child,Female,Owned,1
3,421.3824,656.220,earnings,Eastern,2 adults,No child,Male,Owned,1
4,370.4056,398.800,earnings,South Ea,1 adult,No child,Male,Owned,1
...,...,...,...,...,...,...,...,...,...
5139,482.4708,782.040,earnings,North We,2 adults,No child,Female,Private,1
5140,282.6099,612.272,other so,West Mid,2 adults,No child,Male,Owned,1
5141,934.1562,1134.920,earnings,Wales,1 adult,Two or m,Female,Owned,1
5142,426.5105,663.669,other so,North We,2 adults,No child,Male,Owned,1
5143,700.0040,1076.870,earnings,Scotland,3 adults,No child,Male,Owned,1

In [25]:
# Data frame information
df_exp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5144 entries, 0 to 5143
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   expenditure  5144 non-null   float64
 1   income       5144 non-null   float64
 2   maininc      5144 non-null   object
 3   region       5144 non-null   object
 4   nadults      5144 non-null   object
 5   nkids        5144 non-null   object
 6   SexHRP       5144 non-null   object
 7   housing      5144 non-null   object
 8   internet     5144 non-null   int64
dtypes: float64(2), int64(1), object(6)
memory usage: 361.8+ KB

In [26]:
# Summary statistics of numerical variables
df_exp.describe()

       expenditure       income     internet
count  5144.000000  5144.000000  5144.000000
mean    479.758420   620.433571     0.822706
std     292.365227   359.155681     0.381954
min      30.525000     0.000000     0.000000
25%     254.127825   314.101875     1.000000
50%     419.903450   563.150000     1.000000
75%     644.974425   928.035500     1.000000
max    1175.000000  1184.990000     1.000000

## Exercise 6

Using the expenditure survey ```df_exp``` data frame, answer the following questions:

1. How many British households have a weekly expenditure between £200 and £300?
2. What is the median weekly income in Wales?
3. What is the percentage of households in London with no children?
4. How many households outside London own a house?

In [27]:
df_exp.head()

,expenditure,income,maininc,region,nadults,nkids,SexHRP,housing,internet
0,380.6958,465.36,earnings,East Mid,2 adults,Two or m,Female,Public r,1
1,546.4134,855.26,earnings,London,2 adults,No child,Female,Owned,1
2,242.1890,160.96,earnings,South Ea,1 adult,No child,Female,Owned,1
3,421.3824,656.22,earnings,Eastern,2 adults,No child,Male,Owned,1
4,370.4056,398.80,earnings,South Ea,1 adult,No child,Male,Owned,1

In [28]:
# 1
exp_within_200_300 = (df_exp["expenditure"] > 200) & (df_exp["expenditure"] < 300)
df_exp.loc[exp_within_200_300, "expenditure"].count()

812

In [29]:
# 2
wales_hh = (df_exp["region"] == "Wales")
df_exp.loc[wales_hh, "income"].median()

544.8

In [30]:
# 3
london_hh = (df_exp["region"] == "London")
df_exp.loc[london_hh, "nkids"].value_counts(normalize=True)

No child    0.658333
Two or m    0.206250
One chil    0.135417
Name: nkids, dtype: float64

In [31]:
# 4
no_london_hh = ~(df_exp["region"] == "London")
df_exp.loc[no_london_hh, "housing"].value_counts()

Owned       3193
Public r     785
Private      686
Name: housing, dtype: int64